Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: འགྲོ་བ་ཐམས་ཅད་ལ་མི་འཚེ་ཞིང་འཐོ་འཚམ་མེད་པ་ལ་ཞུགས་ཏེ། འཇིག་རྟེན་ཕ་རོལ་ལ་ལྟ་བུར་གྱུར་ནས། ཐལ་མོ་སྦྱར་ཅིང་ཤིན་ཏུ་དགའ་བའི་སེམས་ཀྱིས་རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེར་འདུད་ཅིང་ཕྱག་འཚལ་བར་གྱུར་ཏེ། ལུས་དང་སེམས་ཀྱི་བདེ་བ་རྒྱ་ཆེན་པོ་མཚུངས་པ་མེད་པ་ཡང་མྱོང་བར་གྱུར་ཏོ། །
en: With their palms together in homage, with the highest happiness, they bowed in the direction of King Mahāprabha, experiencing an unequaled vast bliss of mind and body.

source: དེ་ལྟར་གླིང་བཞི་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་ཀུན་གྱི་འཇིགས་པ་དང་། གནོད་པ་དང་། མི་བདེ་བ་དང་། ཤར་གཉེར་བ་དང་། ཐབ་མོ་དང་། རྩོད་པ་དང་། སེམས་ཀྱི་འཁྲུག་པ་དང་། འཚེ་བའི་སེམས་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ། །རྣམ་པར་ཞི་བར་གྱུར་ཏོ། །རྣམ་པར་ལོག་པར་གྱུར་ཏོ། །འགགས་པར་གྱུར་ཏོ། །ཕྱིར་ལོག་པར་གྱུར་ཏོ། །
en: In the same way, for all beings in the four-continent world realm, fear, misfortune, hostility, disputes, mental disturbances, and violent intentions ceased, were extinguished, were eliminated, were brought to an end, and were eradicated.

source: གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི། ཁམས་ཐམས་ཅད་ནས། ཕྱོགས་བཅུར་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་བར་གྱི་སེམས་ཅན་ཀུན་གྱི་འཇིགས་པ་དང་། གནོད་པ་དང་། མི་བདེ་བ་དང་། ཤར་གཉེར་བ་དང་། ཐབ་མོ་དང་། རྩོད་པ་དང་། སེམས་ཀྱི་འཁྲུག་པ་དང་། འཚེ་བའི་སེམས་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བྱམས་པ་ཆེན་པོའི་སྔོན་དུ་འགྲོ་བ། འཇིག་རྟེན་གྱི་དབང་པོའི་ཀློང་གི་ཆོས་ཉིད་ཐོབ་པའི་ཕྱིར། རབ་ཏུ་ཞི་བར་གྱུར་ཏོ། རྣམ་པར་ཞི་བར་གྱུར་ཏོ། རྣམ་པར་ལོག་པར་གྱུར་ཏོ། །
en: In the same way as it was for the four-continent world realm, so it was that for all beings throughout the great universe of a billion worlds, throughout a quintillion world realms in the ten directions, all fear, misfortune, hostility, disputes, mental disturbances, and sinful and violent intentions ceased, were extinguished, were eliminated, were brought to an end, and were eradicated through their attaining the nature of the bodhisattva samādhi called exercising power over the world through being motivated by great love.

source: འགགས་པར་གྱུར་ཏོ། ཕྱིར་ལོག་པར་གྱུར་ཏོ། དེ་ནས་རྒྱལ་པོ་འོད་ཆེན་པོ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཡེ་ཤེས་སྣང་བའི་སྒོ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་འདི་ཤེས་པར་ཟད་ན། ངས་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་བདེ་བའི་བསམ་པས་རྒྱས་པར་འགེངས་པས་བྱམས་པ་ཆེན་པོའི་གདུགས་ཚད་མེད་པ་དང་ལྡན་པ། འཁོར་མི་ཕྱེད་པ་དང་ལྡན་པས། འགྲོ་བ་ཐམས་ཅད་འཁོར་དུ་གྱུར་པ། རབ་འབྲིང་དང་ཐ་མའི་སྦྱོར་བས་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་ཞུགས་པ། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བུ་ལ་ཞུགས་པས། བྱམས་པའི་སེམས་ལྟ་བུ་དང་ལྡན་པ། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་འོད་ཟེར་འགྲོ་བ་ཐམས་ཅད་དུ་འབྱུང་བས། ཟླ་བ་ཉ་ཞིང་རྒྱས་པ་ལྟ་བུར་གྱུར་པ།
en: Then King Mahāprabha arose from that samādhi and said to Sudhana, the head merchant’s son, “Noble one, I know only this wisdom of bodhisattva conduct called the banner of great love.

source: ཤེས་བྱ་ཐམས་ཅད་ཡེ་ཤེས་ཀྱི་འོད་ཀྱིས་སྣང་བར་བྱེད་པའི་ཕྱིར་ཉི་མའི་དཀྱིལ་འཁོར་ལྟ་བུར་གྱུར་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་མུན་པ་ཐིབས་པོ་རབ་ཏུ་སེལ་བས། སྒྲོན་མ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་མཚོའི་གཡོ་སྒྱུའི་རྙོག་པ་དང་བར་བྱེད་པས། ནོར་བུ་རིན་པོ་ཆེ་ཆུ་འདོད་དང་འདྲ་བ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་། སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས། ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོ་དང་འདྲ་བ། འགྲོ་བ་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཁང་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕོ་བྲང་ཆེན་པོར་གཞོག་པས་རླུང་མར་ཆེན་པོ་དང་འདྲ་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “How could I know the conduct or describe the qualities of the bodhisattvas who hold the immeasurable parasol of great love; who pervade all the world realms with their motivation to bring happiness; who are attendants for all beings through continual attendance to them; who are dedicated to the protection of all beings applied equally to the highest, the middling, and the lowest beings; who have a loving motivation that is like the earth, for it is engaged in supporting all beings; who are like the disk of the full moon sending the light rays of merit and wisdom equally to all beings; who are like the disk of the sun because they shine the light of wisdom on everything that is to be known; who are like lamps because they dispel the deep darkness in the minds of all beings; who are like the precious jewel that purifies water because they clear away the turbidity of deceit and deception in the lakes of the minds of all beings; who are like the king of wish-fulfilling jewels because they fulfill the aspirations and prayers of all beings; who are like a great wind because they make them live in the dwelling place of resting in samādhi, which is the great city of omniscience?

source: ཡོན་ཏན་བརྗོད་པའམ། བསོད་ནམས་ཀྱི་རི་བོ་གཞལ་བའམ།
en: “How could I measure their mountain of merit?

source: ཡོན་ཏན་གྱི་སྐར་མའི་ཚོགས་ཀྱིས་བརྒྱན་པའི་ནམ་མཁའ་ལ་བལྟ་བའམ།
en: How could I view the sky that is adorned by the myriads of stars of their qualities?

source: སྨོན་ལམ་ཆེན་པོའི་རླུང་གི་དཀྱིལ་འཁོར་ལས་མཚམས་བཅད་པའམ།
en: How could I know the circle of air that is their great prayers?

source: ཆོས་མཉམ་པ་ཉིད་ཀྱི་སྟོབས་ལ་ཚད་གཟུང་བའམ།
en: How could I measure their power of the equality of all phenomena?

source: ཐེག་པ་ཆེན་པོའི་རྒྱན་གྱི་བསྔགས་པ་ཡོངས་སུ་བརྗོད་པའམ།
en: How could I explain their praises of the array of the Mahāyāna?

source: ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་ཚུལ་གྱི་ཁྱད་པར་བརྗོད་པའམ།
en: How could I describe their special way of completely good conduct?

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཆེན་པོ་བསྒོམ་པའི་སྒོ་དབྱེ་བའམ།
en: How could I reveal the gateway to the great samādhi of the bodhisattvas?

source: སྙིང་རྗེ་ཆེན་པོའི་སྤྲིན་ཡོངས་སུ་སྨོས་པར་ནུས་རེ་སྐན། །
en: How could I describe their clouds of great compassion? “Depart, noble one.

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་རྒྱལ་པོའི་གནས་བརྟན་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a capital city called Sthirā.

source: དེ་ན་དགེ་བསྙེན་མ་མི་གཡོ་བ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells an upāsikā by the name of Acalā.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་རྒྱལ་པོ་འོད་ཆེན་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། རྒྱལ་པོ་འོད་ཆེན་པོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས། རྒྱལ་པོ་འོད་ཆེན་པོའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་གསུམ་པ། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་ནས་བྱུང་སྟེ་ཡུད་ཙམ་དུ་ལམ་གྱི་འགོ་བཙལ་ནས། རྒྱལ་པོ་འོད་ཆེན་པོའི་གདམས་ངག་དེ་ལ་རྗེས་སུ་བསམ་པ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཚུལ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་འཇིག་རྟེན་གྱི་དབང་པོའི་གློང་གིས་སྣང་བ་ཆེན་པོ་དེ་ཡོངས་སུ་བསྒོམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལུས་རྣམ་པར་དག་པ། བསམ་གྱིས་མི་ཁྱབ་པས་བརྒྱན་པའི་སེང་གེའི་ཁྲིའི་རྒྱན་རྣམ་པར་ཕྱེ་བ། རྣམ་པ་སྣ་ཚོགས་དེ་དག་མངོན་པར་བསྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་དང་། བསོད་ནམས་ཀྱི་དབང་དང་། སྟོབས་བསམ་གྱིས་མི་ཁྱབ་པ། དེ་དག་རྗེས་སུ་སྤེལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཡེ་ཤེས་ཀྱི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ཤིན་ཏུ་བསྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལོངས་སྤྱོད་ཀྱི་བདག་ཉིད་ཆེ་བ་ཐུན་མོང་དུ་གྱུར་པ། བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ལ་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་གནས་རྣམ་པ་ཐ་དད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་དག་ཀྱང་མཚན་མར་བྱ་བ་དང་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of King Mahāprabha, circumambulated King Mahāprabha many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from King Mahāprabha.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ། རྗེས་སུ་དྲན་པར་བྱ་བ་དང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཕུན་སུམ་ཚོགས་ཤིང་ཡོངས་སུ་དག་པ་དེ་ལ་བརྟག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་གྱི་དོན་བསམ་པ་སྣང་བའི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ལ་ཡིད་ཆེས་པར་བྱེད་བྱེད་པས། སེམས་དགའ་ཞིང་མོས་པའི་ཤུགས་དང་། སེམས་ཀྱི་ཉམས་བདེ་བ་དང་། སེམས་ཤིན་ཏུ་ཚིམ་པ་དང་། སེམས་ཁོང་ནས་དགའ་བ་དང་། སེམས་རྙོག་པ་མེད་པ་དང་། སེམས་འོད་དང་བ་དང་།
en: Acalā Chapter 22 Sudhana, the head merchant’s son, left the city of Suprabha, and having followed the road for a little while, he contemplated the instruction given to him by King Mahāprabha: he remembered the way of bodhisattva conduct called the banner of great love; he meditated on the light of the great samādhi called exercising power over the world; he realized the variegated display of the lion throne and adornments of the pure bodhisattva body; he increased the inconceivable power and strength of bodhisattva aspiration and merit; he made firm the inconceivable way of bodhisattva wisdom that ripens beings; he reflected upon the inconceivable greatness of the general enjoyments of the bodhisattvas; he considered the inconceivable different aspects of the bodhisattvas; he remembered the inconceivable pure ripening of beings by bodhisattvas; he thought about the inconceivable pure and perfect bodhisattva assembly of pupils; he had conviction in the inconceivable radiance of the bodhisattvas’ dedication to their duty to beings; and he attained happiness, powerful attraction, delight, contentment, deep joy, clarity of mind, brightness of mind, stability of mind, vastness of mind, and inexhaustibility of mind.

source: སེམས་བརྟན་པ་དང་། སེམས་རྒྱ་ཆེ་བ་དང་། སེམས་མི་ཟད་པ་ཐོབ་སྟེ། དེ་དེ་ལྟར་དགེ་བའི་བཤེས་གཉེན་རྗེས་སུ་དྲན་ཞིང་ཡིད་ལ་བྱེད་པ་ལ་བརྩོན་པས།
en: He was in that way dedicated to remembering and thinking of the kalyāṇamitra.

source: གདོང་མཆི་མས་གང་ནས་རྗེས་སུ་སེམས་པ།
en: With his face covered in tears, he thought “Ah!

source: ཀྱི་ཧུད་ཀྱེ་དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་འདི་ནི་ཡོན་ཏན་རིན་པ་ཆེ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་སུ་གྱུར་པའོ། །
en: Oh! Seeing the kalyāṇamitra is the source of all precious qualities.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཡོངས་ས་དག་པ་དང་། ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་རྒྱུར་གྱུར་པའོ། །
en: It perfects and purifies all bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་དྲན་པ་ཐམས་ཅད་རྣམ་པར་དག་པར་བྱེད་པའོ། །
en: It makes pure all bodhisattva mindfulness.

source: བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་བའོ། །
en: It purifies all the domains of bodhisattva retention.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྣང་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱེད་པའོ་སངས་རྒྱས་ཐམས་ཅད་མཐོང་བར་འགྱུར་བ་ཡོངས་སུ་སྒྲུབ་པའོ། །
en: It gives rise to the radiance of all bodhisattva samādhis. It accomplishes seeing all buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པའོ། །
en: It brings down the rain from the Dharma clouds of all the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་ཚུལ་ཐམས་ཅད་རབ་ཏུ་བརྗོད་པའོ། །
en: It indicates the way of all bodhisattva prayers.

source: ཤེས་རབ་དང་ཡེ་ཤེས་ཀྱི་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པར་ཡང་དག་པར་སྐྱེད་པའོ། །
en: It gives rise to the inconceivable light of knowledge and wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་བརྟན་པའི་མྱི་གུ་སྐྱེད་པར་བྱེད་པའོ། །
en: It grows the sprouts of stable bodhisattva faculties.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ངན་སོང་གི་གཡང་ས་ཐམས་ཅད་ནས་སྐྱོབ་པའོ།
en: The kalyāṇamitras save me from falling into the chasm of the lower existences.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ཆོས་མཉམ་པ་ཉིད་ཀྱི་ཚུལ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་གཞོག་པའོ། །
en: The kalyāṇamitras have brought me to the realization of the way of the equality of phenomena.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་ལམ་བདེ་བ་དང་། མི་བདེ་བ་སྟོན་པའོ།
en: The kalyāṇamitras have shown me the paths to happiness and to unhappiness.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་ཐེག་པ་ཆེན་པོ་ཡོངས་སུ་སྟོན་པའོ། །
en: The kalyāṇamitras have taught me the Mahāyāna.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་གདམས་ངག་གིས་འདེམས་པའོ། །
en: The kalyāṇamitras have given me the instructions on the completely good bodhisattva conduct.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་གྱི་ལམ་སྟོན་པའོ། །
en: The kalyāṇamitras have shown me the road to the city of omniscience.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ཐམས་ཅད་མཁྱེན་པའི་གནས་སུ་ཕྱིན་པར་སྐྱེལ་བའོ། །
en: The kalyāṇamitras have guided me on the way to the town of omniscience.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པར་བྱེད་པའོ།
en: The kalyāṇamitras have made me enter the ocean of the ways of the realm of the Dharma.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་དུས་གསུམ་གྱི་ཤེས་བྱ་རྒྱ་མཚོའི་ཚུལ་རབ་ཏུ་སྟོན་པའོ། །
en: The kalyāṇamitras have taught me the ways of an ocean of what is to be known in the three times.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་འཕགས་པའི་ཚོགས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རབ་ཏུ་སྟོན་པའོ། །
en: The kalyāṇamitras have shown me all the circles of ārya assemblies.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་གི་དཀར་པོའི་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕེལ་བར་བྱེད་པའོ་ཞེས་དེ་དེ་ལྟར་དུ་ཞིང་སྨྲེ་སྔགས་འདོན་པའི་ཚེ།
en: The kalyāṇamitras have increased all my good qualities.”

source: ནམ་མཁའི་དབྱིངས་ལ་འཁོད་པའི་ལྷའི་ཚོགས་དང་། རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་ཞིང་ཡང་དག་པར་བསྐུལ་བ་དང་། སངས་རྒྱས་ཀྱི་ཕོ་ཉ་ལྟར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འདི་སྐད་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་ཐུགས་ཤིན་ཏུ་དགྱེས་པར་འགྱུར་བ་ཡིན།
en: While he thus wept and wailed, the devas who were assembled in the sky, who were bodhisattva devas, emissaries of the buddhas who continually followed him and inspired him, called down to him, “Noble one, the bodhisattvas who follow the instructions of the kalyāṇamitras greatly please the buddha bhagavats.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཚིག་དང་། མི་འགལ་བར་གནས་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུའང་ཤིན་ཏུ་བསྙེན་པ་ཡིན།
en: The bodhisattvas who never go against the words of the kalyāṇamitras come close to omniscience.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཚིག་ལ་ཐེ་ཙོམ་མི་ཟ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་དགེ་བའི་བཤེས་གཉེན་རྣམས་ཀྱང་ཉེ་བར་བསྙེན་པ་ཡིན།
en: The bodhisattvas who do not doubt the words of the kalyāṇamitras come close to the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་དོན་ཐམས་ཅད་ཀྱང་མངོན་དུ་འགྱུར་བ་ཡིན་གྱིས།
en: The bodhisattvas who always have the kalyāṇamitras in their minds are approaching all their goals.

source: རིགས་ཀྱི་བུ་རྒྱལ་པོའི་ཕོ་བྲང་བརྟན་པར་དགེ་བསྙེན་མ་མི་གཡོ་བ་གང་ན་བ་དེར་སོང་ཤིག་དང་།
en: “Noble one, go to the upāsikā Acalā in the royal capital of Sthirā!

source: དེ་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐོས་པར་འགྱུར་རོ། །
en: You will hear the bodhisattva conduct from her.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཏིང་ངེ་འཛིན་གྱི་ཡེ་ཤེས་སྣང་བ་ལས་ལངས་ནས་མཐར་གྱིས་རྒྱལ་པོའི་ཕོ་བྲང་བརྟན་པར་དགེ་བསྙེན་མ་མི་གཡོ་བ་གང་ན་བ་དེར་སོང་ནས། དགེ་བསྙེན་མ་མི་གཡོ་བ་ཡོངས་སུ་ཚོལ་ཞིང་རྨེད་རྨེད་པ་ལས།
en: Then Sudhana, the head merchant’s son, emerged from samādhi’s light of wisdom and eventually arrived at Sthirā, where the upāsikā Acalā was.

source: དེ་ལ་འགྲོ་བ་མང་པོས་བསྟན་པ། རིགས་ཀྱི་བུ་དགེ་བསྙེན་མ་མི་གཡོ་བ་དེ་ནི་རང་གི་ཁྱིམ་ན་ཕ་མ་དང་། འགྲོགས་ཤིང་གཞོན་ནུར་གྱུར་པ་སྟེ། རང་གི་གཉེན་བཤེས་ཀྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ལ་ཆོས་སྟོན་ཏོ། །
en: He searched and looked for the upāsikā Acalā, and many people said to him, “Noble one, the upāsikā Acalā is young and lives with her parents at home, where, surrounded by her family, she teaches the Dharma to a great gathering of people.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་བ་ཆེན་པོ་དང་། མོས་ཤིང་སྤྲོ་བས། ཡོངས་སུ་རྒྱས་པའི་སེམས་དང་ལྡན་པ་དེ་དགེ་བསྙེན་མ་མི་གཡོ་བའི་ཁྱིམ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Then Sudhana, the head merchant’s son, his mind filled with great happiness, enthusiasm, and joy, went to the home of the upāsikā Acalā.

source: དགེ་བསྙེན་མ་མི་གཡོ་བའི་ཁྱིམ་གྱི་སྒོ་ན་སྡོད་པའི་ཚེ། དེས་ཁྱིམ་དེ་ཐམས་ཅད་འོད་ལུས་དང་སེམས་ཤིན་ཏུ་བདེ་བར་བྱེད་པ། གསེར་གྱི་ཁ་དོག་ཏུ་འདུག་པ་ཞིག་གིས་ཁྱབ་ཅིང་གསལ་བར་གྱུར་ནས།
en: After arriving there, while he was waiting at the door he saw the entire house shining with a pervading golden light that brought ease to mind and body.

source: འོད་དེས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཕོག་པར་གྱུར་མ་ཐག་ཏུ་ཚོར་བ་ཐམས་ཅད་ལ་དབང་བསྒྱུར་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་དང་། ཞི་བའི་གནས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་དང་། འགྲོ་བ་ཐམས་ཅད་དང་བྲལ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་དང་། ཀུན་ཏུ་ལྟ་བའི་བཏང་སྙོམས་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་དང་། དེ་བཞིན་གཤེགས་པའི་མཛོད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་ལ་སྩོགས་པ།
en: The instant the light touched Sudhana, the head merchant’s son, he entered, and there arose five hundred subtle and newly developed entrances to samādhi such as entrances to the samādhi called power over all sensations, entrances to the samādhi called the region of peace, entrances to the samādhi called apart fromall beings, entrances to the samādhi called the all-seeing equanimity, and entrances to the samādhi called the treasure of the tathāgatas.

source: ཏིང་ངེ་འཛིན་གྱི་སྒོ་ལྔ་བརྒྱ་ཙམ་ལ་ཞུགས་པར་གྱུར་ཏེ། ཡོངས་སུ་སྐྱེས་སོ། །དེ་དག་ཀྱང་ཤིན་ཏུ་ཕྲ་ཞིང་གཞོན་པ་སྟེ། འདི་ལྟར་དཔེར་ན་ཐོག་མ་མངལ་དུ་ཞུགས་པའི་རྣམ་པར་ཤེས་པ་ལྟ་བུ་སྟེ། ཏིང་ངེ་འཛིན་དེ་དག་ཀྱང་ཤིན་ཏིུ་ཕྲ་ཞིང་གཞོན་པར་སྐྱེས་པར་གྱུར་ཏོ། །དེས་དྲི་ཞིམ་པོ་ཞིག་ཚོར་ནའང་དེ་ནི་ལྷ་ལའང་མེད་ལྷའི་བུ་མོ་ལ་ཡང་མེད།
en: Those samādhis were very subtle and newly developed like a consciousness that has just entered the womb.

source: ཀླུ་ལ་ཡང་མེད་ཀླུའི་བུ་མོ་ལ་ཡང་མེད། གནོད་སྦྱིན་ལ་ཡང་མེད་གནོད་སྦྱིན་གྱི་བུ་མོ་ལ་ཡང་མེད། དྲི་ཟ་ལ་ཡང་མེད། དྲི་ཟའི་བུ་མོ་ལ་ཡང་མེད། ལྷ་མ་ཡིན་ལ་ཡང་མེད། ལྷ་མ་ཡིན་གྱི་བུ་མོ་ཡང་མེད། ནམ་མཁའི་ལྡིང་ལ་ཡང་མེད། ནམ་མཁའ་ལྡིང་གི་བུ་མོ་ལ་ཡང་མེད། མིའམ་ཅི་ལ་ཡང་མེད། མིའམ་ཅིའི་བུ་མོ་ལ་ཡང་མེད།
en: Then Sudhana sensed a lovely scent of such a kind that male devas did not have, that female devas did not have, that male nāgas did not have, that female nāgas did not have, that male yakṣas did not have, that female yakṣas did not have, that male gandharvas did not have, that female gandharvas did not have, that male asuras did not have, that female asuras did not have, that male garuḍas did not have, that female garuḍas did not have, that male kinnaras did not have, that female kinnaras did not have, that male mahoragas did not have, that female mahoragas did not have, that male humans did not have, and that female humans did not have.

source: ལྟོ་འཕྱེ་ཆེན་པོ་ལ་ཡང་མེད། ལྟོ་འཕྱེ་ཆེན་པོའི་བུ་མོ་ལ་ཡང་མེད། མི་ལ་ཡང་མེད། མིའི་བུ་མོ་ལ་ཡང་མེད་ཅིང་མི་སྲིད་པ་དེ་ལྟ་བུའི་དྲི་ཞིམ་པོ་ཚོར་བར་གྱུར་ཏོ། བུད་མེད་དེའི་གཟུགས་དང་མཉམ་པ་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་།
en: There was no equal to that girl’s body in the worlds in the ten directions, let alone one that was superior.

source: ཁ་དོག་དང་མདོག་དེ་ལྟ་བུ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་མདོག་དང་ཁ་དོག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བའི་ཁ་དོག་དང་མདོག་མ་གཏོགས་པར་དེའི་ཁ་དོག་དང་། མདོག་ཏུ་མཉམ་པ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་། ལུས་ཀྱི་ཆུ་ཞེང་དང་དབྱིབས་དེ་ལ་བུ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཁྲུན་ཆུ་ཞེང་དང་།
en: Apart from the luster of the color of the bodies of the tathāgatas, and the luster of the color of consecrated bodhisattvas, there was no one in the worlds in the ten directions who had a body with a luster of color that equaled the luster of color of her body, let alone one that was superior.

source: དབྱིབས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བ་ཐོབ་པའི་ལུས་ཀྱི་ཆུ་ཞེང་དང་། དབྱིབས་མ་གཏོགས་པར་དེའི་ལུས་ཀྱི་ཆུ་ཞེང་དང་དབྱིབས་སུ་མཉམ་པ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་།
en: Apart from the shape and figure of the bodies of the tathāgatas, and the shape and figure of consecrated bodhisattvas, there was no one in the worlds in the ten directions who had a body with a shape and figure that equaled the shape and figure of her body, let alone one that was superior.

source: འོད་ཀྱི་རྒྱན་དེ་ལྟ་བུའང་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱི་རྒྱན་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བ་ཐོབ་པའི་འོད་ཀྱི་རྒྱན་མ་གཏོགས་པར་དེའི་འོད་ཀྱི་རྒྱན་དང་། མཉམ་པ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་།
en: Apart from the aura of light of the tathāgatas, and the aura of light of consecrated bodhisattvas, there was no one in the worlds in the ten directions who had an aura of light that equaled her aura of light, let alone one that was superior.

source: དེའི་ཁའི་ངད་ཀྱི་དྲི་ཞིམ་པོ་དང་མཉམ་པའི་དྲི་དེ་ལྟ་བུ་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ལྷའི་གནས་སམ། ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་།
en: Apart from the tathāgatas and the consecrated bodhisattvas, there was no one in the worlds in the ten directions, in the realms of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, or nonhumans, who had a scent that equaled the scent of the breath that came from her mouth, let alone one that was superior.

source: མི་དང་མི་མ་ཡིན་པའི་གནས་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་། ཁྱིམ་གྱི་རྒྱན་དང་། ལོངས་སྤྱོད་དེ་ལྟ་བུའང་དེ་བཞིན་གཤེགས་པའི་ལོངས་སྤྱོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བ་ཐོབ་པའི་ལོངས་སྤྱོད་མ་གཏོགས་པར་དེའི་ཁྱིམ་གྱི་རྒྱན་དང་། ལོངས་སྤྱོད་དུ་མཉམ་པ་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་།
en: Apart from the displays and enjoyments of the abodes of the tathāgatas, and the displays and enjoyments of the abodes of the consecrated bodhisattvas, there was no one in the worlds in the ten directions who could equal the displays and enjoyments of her abode, let alone anyone who could be her superior.

source: གཡོག་འཁོར་ཕུན་སུམ་ཚོགས་པ། དེ་ལྟ་བུའང་དེ་བཞིན་གཤེགས་པའི་འཁོར་ཕུན་སུམ་ཚོགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཕུན་སུམ་ཚོགས་པ་མ་གཏོགས་པར་དེའི་གཡོག་འཁོར་ཕུན་སུམ་ཚོགས་པ་དང་། མཉམ་པ་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་སྟེ།
en: Apart from the perfect entourage of attendants of the tathāgatas and the perfect entourage of attendants of the consecrated bodhisattvas, there was no one in the worlds in the ten directions who could equal her perfect entourage of attendants, let alone anyone who could be her superior.

source: དགེ་བསྙེན་མ་མི་གཡོ་བ་དེ་ལ་འདོད་ཆགས་དང་ལྡན་པའི་སེམས་ཀྱིས་བལྟ་བར་ནུས་པའི་སེམས་ཅན་དེ་ལྟ་བུའང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་སེམས་ཅན་གྱི་རིས་ན་མེད་དོ། །
en: There was no being among the classes of beings in the worlds in the ten directions who could look upon the upāsikā Acalā with desire.

source: དགེ་བསྙེན་མ་མི་གཡོ་བ་དེ་མཐོང་མ་ཐག་དུ་ཉོན་མོངས་པ་ཞི་བར་མི་འགྱུར་བ་དེ་ལྟ་བུའི་སེམས་ཅན་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་སེམས་ཅན་གྱི་རིས་ན་མེད་དེ།
en: There was no being among the classes of beings in the worlds in the ten directions whose kleśas did not cease as soon as they saw the upāsikā Acalā.

source: འདི་ལྟ་སྟེ་དཔེར་ན། ཚངས་པ་ཆེན་པོ་སྟོང་ཕྲག་བཅུ་ལ་དབང་སྒྱུར་བ་ལ་ནི་འདོད་པ་ལ་སྤྱོད་པའི་ཉོན་མོངས་པ་རྣམས་མི་རྒྱུའོ། །དེ་བཞིན་དུ་དགེ་བསྙེན་མ་མི་གཡོ་བའང་མཐོང་མ་ཐག་ཏུ་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་མི་རྒྱུའོ། །
en: Just as the Mahābrahmās who have power over a million desire realms do not have kleśas arising within them, in the same way, the beings who saw the upāsikā Acalā did not have kleśas arising within them.

source: དགེ་བསྙེན་མ་མི་གཡོ་བ་དེ་ལ་བལྟ་བས་ངོམས་པར་འགྱུར་བའི་སེམས་ཅན་དེ་ལྟ་བུའང་ཤེས་རབ་ཀྱིས་ངོམས་པ་མ་གཏོགས་པར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་གྱི་རིས་ན་མེད་དོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བསྙེན་མ་མི་གཡོ་བའི་ལུས་ཀྱི་བྱིན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་།
en: There was no being among the classes of beings in the worlds in the ten directions who had enough of looking upon the upāsikā Acalā, apart from those who had the contentment of wisdom.

source: གཟུགས་དང་ཁ་དོག་དང་དབྱིབས་དང་། ཆུ་ཞེང་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སའི་གཞི་དང་། གྲོང་ཁྱེར་དང་རིན་པོ་ཆེ་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པའི་འོད་ཟེར་གྱི་དྲ་བའི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སེམས་ཅན་གྱི་དོན་བསམ་གྱིས་མི་ཁྱབ་པ་བསྒྲུབ་པ་མཐོང་སྟེ།
en: Sudhana, the head merchant’s son, saw the inconceivable majesty of the upāsikā Acalā’s body and her inconceivable form, color, shape, and figure; he saw the inconceivable network of unimpeded light rays from the entirety of the ground, city, and jewels; and he saw the accomplishment of inconceivable benefits for beings.
